PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/mqtt_manager/mqtt_manager.c
#include "mqtt_manager.h"
#include <string.h>
#include <stdio.h>
#include <inttypes.h>
#include <errno.h>
#include <time.h>
#include <sys/socket.h>
#include <netdb.h>
#include <lwip/netdb.h>
#include <lwip/sockets.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "freertos/semphr.h"
#include "freertos/queue.h"
#include "esp_log.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "mqtt_client.h"
#include "esp_tls.h"
#include "mqtt_ssl_setup.h"
#include "esp_random.h"
#include "config_manager.h"
#include "esp32_id_manager.h"
#include "wifi_manager.h"
#include "time_manager.h"
#include "esp_task_wdt.h"
#include "esp_heap_caps.h"

#define TAG "MQTT_MGR"

// Event group bits
#define MQTT_CONNECTED_BIT BIT0
#define MQTT_DISCONNECTED_BIT BIT1
#define MQTT_ERROR_BIT BIT2

// Default values optimized for 4MB ESP32
#define DEFAULT_BROKER "node02.myqtthub.com"
#define DEFAULT_PORT 8883
#define DEFAULT_KEEPALIVE 120
#define DEFAULT_RECONNECT_TIMEOUT_MS 10000
#define DEFAULT_MAX_RETRIES 3
#define DEFAULT_BUFFER_SIZE 512
#define DEFAULT_MAX_QUEUE_SIZE 5  
#define DEFAULT_STATUS_INTERVAL_MS 300000  // 5 minutes

// Pending message structure
typedef struct {
    char topic[MQTT_TOPIC_MAX_LENGTH];
    char data[DEFAULT_BUFFER_SIZE];
    int data_len;
    int qos;
    bool retain;
} mqtt_pending_message_t;

// MQTT Manager context
typedef struct {
    mqtt_manager_state_t state;
    esp_mqtt_client_handle_t client;
    EventGroupHandle_t event_group;
    SemaphoreHandle_t mutex;
    QueueHandle_t pending_messages;
    
    char broker_url[MQTT_BROKER_MAX_LENGTH];
    int port;
    bool use_ssl;
    char client_id[MQTT_CLIENT_ID_MAX_LENGTH];
    char username[MQTT_USERNAME_MAX_LENGTH];
    char password[MQTT_PASSWORD_MAX_LENGTH];
    char lwt_topic[MQTT_TOPIC_MAX_LENGTH];
    char lwt_message[MQTT_LWT_MESSAGE_MAX_LENGTH];
    int lwt_qos;
    bool lwt_retain;
    
    char esp32_id[ESP32_ID_BUFFER_SIZE];
    char mac_address[ESP32_MAC_BUFFER_SIZE];
    
    bool was_connected;
    int reconnect_attempts;
    int64_t last_reconnect_time;
    int64_t last_activity_time;
    int64_t last_heartbeat_time;
    
    mqtt_manager_message_callback_t message_callback;
    void *message_user_data;
    mqtt_manager_state_callback_t state_callback;
    void *state_user_data;
    
    char panel_id[32];        
    char client_panel_id[32]; 
    
    char config_topic[MQTT_TOPIC_MAX_LENGTH];
} mqtt_manager_context_t;

static mqtt_manager_context_t s_mqtt_manager_ctx = {0};

// Input validation function
static esp_err_t validate_esp32_id(const char *esp32_id) {
    if (esp32_id == NULL) {
        ESP_LOGE(TAG, "ESP32 ID is NULL");
        return ESP_ERR_INVALID_ARG;
    }
    
    size_t len = strlen(esp32_id);
    if (len == 0) {
        ESP_LOGE(TAG, "ESP32 ID is empty");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (len > ESP32_ID_LENGTH) {
        ESP_LOGE(TAG, "ESP32 ID too long: %zu chars (max %d)", len, ESP32_ID_LENGTH);
        return ESP_ERR_INVALID_ARG;
    }
    
    for (size_t i = 0; i < len; i++) {
        char c = esp32_id[i];
        if (!((c >= '0' && c <= '9') || (c >= 'A' && c <= 'Z') || (c >= 'a' && c <= 'z'))) {
            ESP_LOGE(TAG, "ESP32 ID contains invalid character: '%c' at position %zu", c, i);
            return ESP_ERR_INVALID_ARG;
        }
    }
    
    return ESP_OK;
}

// Generate message ID
static void generate_message_id(char *buffer, size_t size) {
    uint32_t random = esp_random();
    snprintf(buffer, size, "msg_%" PRIu32, random);
}

// MQTT event handler
static void mqtt_event_handler(void *handler_args, esp_event_base_t base, int32_t event_id, void *event_data) {
    esp_mqtt_event_handle_t event = (esp_mqtt_event_handle_t)event_data;
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    ctx->last_activity_time = esp_timer_get_time() / 1000;
    
    switch (event->event_id) {
        case MQTT_EVENT_CONNECTED:
            ESP_LOGI(TAG, "MQTT connected");
            
            if (xSemaphoreTake(ctx->mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
                ctx->state = MQTT_MANAGER_STATE_CONNECTED;
                ctx->was_connected = true;
                ctx->reconnect_attempts = 0;
                xSemaphoreGive(ctx->mutex);
            }
            
            xEventGroupClearBits(ctx->event_group, MQTT_DISCONNECTED_BIT | MQTT_ERROR_BIT);
            xEventGroupSetBits(ctx->event_group, MQTT_CONNECTED_BIT);
            
            if (ctx->state_callback) {
                ctx->state_callback(ctx->state, ctx->state_user_data);
            }
            
            // Subscribe to config topic
            if (strlen(ctx->esp32_id) > 0) {
                snprintf(ctx->config_topic, sizeof(ctx->config_topic), "esp32/config/%s", ctx->esp32_id);
                mqtt_manager_subscribe(ctx->config_topic, 0);
                
                char reset_topic[MQTT_TOPIC_MAX_LENGTH];
                snprintf(reset_topic, sizeof(reset_topic), "esp32/config/%s/reset", ctx->esp32_id);
                mqtt_manager_subscribe(reset_topic, 0);
            }
            
            // Send pending messages
            mqtt_pending_message_t pending_msg;
            int pending_count = 0;
            while (xQueueReceive(ctx->pending_messages, &pending_msg, 0) == pdTRUE && pending_count < 3) {
                esp_mqtt_client_publish(event->client, pending_msg.topic, pending_msg.data, 
                                        pending_msg.data_len, pending_msg.qos, pending_msg.retain);
                pending_count++;
                vTaskDelay(pdMS_TO_TICKS(50));
            }
            break;
            
        case MQTT_EVENT_DISCONNECTED:
            ESP_LOGW(TAG, "MQTT disconnected");
            
            if (xSemaphoreTake(ctx->mutex, pdMS_TO_TICKS(10)) == pdTRUE) {
                ctx->state = ctx->was_connected ? MQTT_MANAGER_STATE_RECONNECTING : MQTT_MANAGER_STATE_DISCONNECTED;
                xSemaphoreGive(ctx->mutex);
            }
            
