PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/mqtt_manager/mqtt_manager.c
    if (xSemaphoreTake(ctx->mutex, portMAX_DELAY) == pdTRUE) {
        ctx->message_callback = callback;
        ctx->message_user_data = user_data;
        xSemaphoreGive(ctx->mutex);
    }
    
    return ESP_OK;
}

// Set state callback
esp_err_t mqtt_manager_set_state_callback(mqtt_manager_state_callback_t callback, void *user_data) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (xSemaphoreTake(ctx->mutex, portMAX_DELAY) == pdTRUE) {
        ctx->state_callback = callback;
        ctx->state_user_data = user_data;
        xSemaphoreGive(ctx->mutex);
    }
    
    return ESP_OK;
}

// Get current state
mqtt_manager_state_t mqtt_manager_get_state(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return MQTT_MANAGER_STATE_INIT;
    }
    
    return ctx->state;
}

// Send network info - CORREGIDO: Buffer dinámico
esp_err_t mqtt_manager_send_network_info(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL || strlen(ctx->esp32_id) == 0) {
        return ESP_ERR_INVALID_STATE;
    }
    
    size_t free_heap = esp_get_free_heap_size();
    if (free_heap < 30000) {
        ESP_LOGW(TAG, "Insufficient memory for network info: %zu bytes", free_heap);
        return ESP_ERR_NO_MEM;
    }
    
    // Buffer dinámico en lugar de estático
    char *json_buffer = heap_caps_malloc(512, MALLOC_CAP_8BIT);
    if (!json_buffer) {
        ESP_LOGE(TAG, "Failed to allocate network info buffer");
        return ESP_ERR_NO_MEM;
    }
    
    char ip_address[16] = "0.0.0.0";
    wifi_manager_get_ip(ip_address, sizeof(ip_address));
    
    char timestamp_str[32];
    char time_str[32];
    
    if (time_manager_is_synchronized()) {
        time_manager_get_timestamp(timestamp_str, sizeof(timestamp_str));
        time_manager_get_lima_time_str(time_str, sizeof(time_str));
    } else {
        time_t now = time(NULL);
        if (now > 1577836800) {
            snprintf(timestamp_str, sizeof(timestamp_str), "%ld", (long)now);
            
            struct tm *timeinfo = gmtime(&now);
            if (timeinfo) {
                time_t peru_time = now - (5 * 3600);
                struct tm *peru_timeinfo = gmtime(&peru_time);
                if (peru_timeinfo) {
                    strftime(time_str, sizeof(time_str), "%d/%m/%Y, %H:%M:%S", peru_timeinfo);
                } else {
                    snprintf(time_str, sizeof(time_str), "Time unavailable");
                }
            } else {
                snprintf(time_str, sizeof(time_str), "Time unavailable");
            }
        } else {
            snprintf(timestamp_str, sizeof(timestamp_str), "%lld", (long long)(esp_timer_get_time() / 1000));
            snprintf(time_str, sizeof(time_str), "System: %lld ms", (long long)(esp_timer_get_time() / 1000));
        }
    }
    
    int len = snprintf(json_buffer, 512,
                      "{\"esp32_id\":\"%.8s\",\"MAC\":\"%.12s\",\"IP\":\"%.15s\","
                      "\"status\":\"ONLINE\",\"timestamp\":%.20s,\"time\":\"%.31s\"}",
                      ctx->esp32_id, ctx->mac_address, ip_address, timestamp_str, time_str);
    
    esp_err_t ret = ESP_FAIL;
    if (len > 0 && len < 512) {
        ret = mqtt_manager_publish("esp32/network_info", json_buffer, len, 0, false);
        
        if (ret == ESP_OK) {
            vTaskDelay(pdMS_TO_TICKS(10)); 
        }
    } else {
        ESP_LOGE(TAG, "JSON buffer overflow in network info");
        ret = ESP_ERR_NO_MEM;
    }
    
    // Liberar buffer
    free(json_buffer);
    
    return ret;
}

// Send heartbeat - CORREGIDO: Buffer dinámico
esp_err_t mqtt_manager_send_heartbeat(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL || strlen(ctx->esp32_id) == 0) {
        return ESP_ERR_INVALID_STATE;
    }
    
    if (!mqtt_manager_is_connected()) {
        return ESP_FAIL;
    }
    
    size_t free_heap = esp_get_free_heap_size();
    if (free_heap < 25000) {
        ESP_LOGW(TAG, "Insufficient memory for heartbeat: %zu bytes", free_heap);
        return ESP_ERR_NO_MEM;
    }
    
    // Buffer dinámico en lugar de estático
    char *json_buffer = heap_caps_malloc(384, MALLOC_CAP_8BIT);
    if (!json_buffer) {
        ESP_LOGE(TAG, "Failed to allocate heartbeat buffer");
        return ESP_ERR_NO_MEM;
    }
    
    char message_id[16];
    generate_message_id(message_id, sizeof(message_id));
    
    char topic[64];
    snprintf(topic, sizeof(topic), "system/status/%.8s", ctx->esp32_id);
    
    char timestamp_str[20];
    char time_str[32] = {0};
    
    if (time_manager_is_synchronized()) {
        time_manager_get_timestamp(timestamp_str, sizeof(timestamp_str));
        time_manager_get_lima_time_str(time_str, sizeof(time_str));
    } else {
        snprintf(timestamp_str, sizeof(timestamp_str), "%lld", (long long)(esp_timer_get_time() / 1000));
    }
    
    int len;
    if (strlen(ctx->client_panel_id) > 0 && strlen(ctx->panel_id) > 0) {
        if (time_str[0] != 0) {
            len = snprintf(json_buffer, 384,
                          "{\"esp32_id\":\"%.8s\",\"status\":\"ONLINE\","
                          "\"timestamp\":%.15s,\"type\":\"heartbeat\","
                          "\"message_id\":\"%.15s\",\"client_id\":\"%.31s\","
                          "\"panel_id\":\"%.31s\",\"time\":\"%.31s\"}",
                          ctx->esp32_id, timestamp_str, message_id,
                          ctx->client_panel_id, ctx->panel_id, time_str);
        } else {
            len = snprintf(json_buffer, 384,
                          "{\"esp32_id\":\"%.8s\",\"status\":\"ONLINE\","
                          "\"timestamp\":%.15s,\"type\":\"heartbeat\","
                          "\"message_id\":\"%.15s\",\"client_id\":\"%.31s\","
                          "\"panel_id\":\"%.31s\"}",
                          ctx->esp32_id, timestamp_str, message_id,
                          ctx->client_panel_id, ctx->panel_id);
        }
    } else {
        if (time_str[0] != 0) {
            len = snprintf(json_buffer, 384,
                          "{\"esp32_id\":\"%.8s\",\"status\":\"ONLINE\","
                          "\"timestamp\":%.15s,\"type\":\"heartbeat\","
                          "\"message_id\":\"%.15s\",\"time\":\"%.31s\"}",
                          ctx->esp32_id, timestamp_str, message_id, time_str);
        } else {
            len = snprintf(json_buffer, 384,
                          "{\"esp32_id\":\"%.8s\",\"status\":\"ONLINE\","
                          "\"timestamp\":%.15s,\"type\":\"heartbeat\","
                          "\"message_id\":\"%.15s\"}",
                          ctx->esp32_id, timestamp_str, message_id);
        }
    }
    
    esp_err_t ret = ESP_FAIL;
    if (len > 0 && len < 384) {
        ret = mqtt_manager_publish(topic, json_buffer, len, 1, false);
        
        if (ret == ESP_OK) {
            ctx->last_heartbeat_time = esp_timer_get_time() / 1000;
            vTaskDelay(pdMS_TO_TICKS(5));
        }
    } else {
        ESP_LOGE(TAG, "JSON buffer overflow in heartbeat");
        ret = ESP_ERR_NO_MEM;
    }
    
    // Liberar buffer
    free(json_buffer);
    
    return ret;
}

// Emergency memory cleanup - MEJORADO
esp_err_t mqtt_manager_emergency_memory_cleanup(void) {
    mqtt_manager_context_t *ctx = &s_mqtt_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    
    ESP_LOGW(TAG, "Performing emergency MQTT memory cleanup");
    
    // Clear pending message queue
    if (ctx->pending_messages) {
        mqtt_pending_message_t dummy_msg;
        int cleared = 0;
        while (xQueueReceive(ctx->pending_messages, &dummy_msg, 0) == pdTRUE) {
            cleared++;
        }
        if (cleared > 0) {
            ESP_LOGI(TAG, "Cleared %d pending messages", cleared);
        }
    }
    
    // Force heap integrity checks to compact memory
    for (int i = 0; i < 5; i++) {
        heap_caps_check_integrity_all(true);
        vTaskDelay(pdMS_TO_TICKS(50));
    }
    
    size_t free_after = esp_get_free_heap_size();
    ESP_LOGI(TAG, "Memory after MQTT cleanup: %zu bytes", free_after);
    
    return ESP_OK;
}